//INTGRT JOB CLASS=A,MSGLEVEL=(1,1)
//STEP01 EXEC PGM=INTGMAIN
//INPUT DD DSN=INTG.INPUT,DISP=SHR
//OUTPUT DD DSN=INTG.OUTPUT,DISP=(NEW,CATLG)
//SYSPRINT DD SYSOUT=*
