01  EMP-SOURCE-REC.
           05  EMP-SRC-ID          PIC X(4).
           05  EMP-SRC-NAME        PIC X(12).
           05  EMP-SRC-DEPT        PIC X(8).


