IDENTIFICATION DIVISION.
       PROGRAM-ID. MODIFY.
       AUTHOR. VALIDATION-PLATFORM.

       DATA DIVISION.
       LINKAGE SECTION.
       01  LS-VALUE          PIC 9(4).

       PROCEDURE DIVISION USING BY CONTENT LS-VALUE.
       MAIN-LOGIC.
           DISPLAY "MODIFY STARTED".
           DISPLAY "MODIFY RECEIVED VALUE=" LS-VALUE.

           ADD 50 TO LS-VALUE.

           DISPLAY "MODIFY CHANGED LOCAL COPY=" LS-VALUE.

           GOBACK.