       IDENTIFICATION DIVISION.
       PROGRAM-ID. MAIN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-STATUS PIC X(1) VALUE 'N'.
       PROCEDURE DIVISION.
       MAIN-PARA.
           DISPLAY 'SYSTEMAOPS-START'.
           MOVE 'Y' TO WS-STATUS.
           CALL 'WRITER'.
           DISPLAY 'SYSTEMAOPS-END'.
           STOP RUN.
