       IDENTIFICATION DIVISION.
       PROGRAM-ID. WRITER.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-MSG PIC X(30) VALUE SPACES.
       PROCEDURE DIVISION.
       WRITER-PARA.
           MOVE 'WRITER-CALLED' TO WS-MSG.
           DISPLAY WS-MSG.
           EXIT PROGRAM.
