>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-I PIC 9(2) VALUE 0.
01 WS-SUM PIC 9(4) VALUE 0.
PROCEDURE DIVISION.
MAIN-LOGIC.
    DISPLAY "LOOP START".
    PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-I > 5
        COMPUTE WS-SUM = WS-SUM + WS-I
        DISPLAY "ITERATION=" WS-I " SUM=" WS-SUM
    END-PERFORM.
    DISPLAY "LOOP END SUM=" WS-SUM.
    STOP RUN.
