//CONDJOB JOB CLASS=A
//STEP01 EXEC PGM=PAY-MAIN
//INPUT DD DSN=PAY.INPUT,DISP=SHR
//STEP02 EXEC PGM=PAY-VALIDATE,COND=ONLY
//STEP03 EXEC PGM=PAY-REWORK,COND=EVEN
//OUTPUT DD DSN=PAY.OUTPUT,DISP=(NEW,CATLG)
//STEP04 EXEC PGM=PAY-SUMMARY,COND=(0,NE)