//PAYORDER JOB CLASS=A,MSGLEVEL=(1,1)
//STEP01 EXEC PGM=ORDER-MAIN
//INPUT DD DSN=ORDER.INPUT,DISP=SHR
//WORK DD DSN=&&WORK1,DISP=(NEW,PASS),SPACE=(TRK,(10,5))
//STEP02 EXEC PGM=ORDER-VALIDATE
//WORK1 DD DSN=&&WORK1,DISP=(OLD,PASS)
//STEP03 EXEC PGM=ORDER-STORE
//OUTPUT DD DSN=ORDER.OUTPUT,DISP=(NEW,CATLG,DELETE)
//SYSPRINT DD SYSOUT=*