//UNSUPP JOB CLASS=A
//JCLLIB ORDER=(USER.LOADLIB)
//STEP01 EXEC PGM=MAIN-PROGRAM
//INPUT DD DSN=INPUT.DATA,DISP=SHR
//IFBRANCH IF (RC=0) THEN
//STEP02 EXEC PGM=BRANCH-A
//ENDIF
//STEP03 EXEC PGM=REPORT-PROGRAM,COND=EVEN
//OUTPUT DD DSN=OUT.DATA,DISP=(NEW,CATLG)
//    ,VOL=SER=WRK01
//STEP04 EXEC PROC=SHARED-PROC
//STEP05 EXEC PGM=&RUNPGM
//SAY DD DUMMY