       IDENTIFICATION DIVISION.
       PROGRAM-ID. DOUBLE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-MARK PIC X(4) VALUE 'MID'.
       LINKAGE SECTION.
       01 LS-A PIC 9(4).
       01 LS-B PIC 9(4).
       PROCEDURE DIVISION USING LS-A LS-B.
       DOUBLE-PARA.
           ADD 100 TO LS-A.
           ADD 100 TO LS-B.
           CALL 'TRIPLE' USING BY REFERENCE LS-A.
           EXIT PROGRAM.
