       IDENTIFICATION DIVISION.
       PROGRAM-ID. TRIPLE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-MARK PIC X(4) VALUE 'LEAF'.
       LINKAGE SECTION.
       01 LT-X PIC 9(4).
       PROCEDURE DIVISION USING LT-X.
       TRIPLE-PARA.
           ADD 1000 TO LT-X.
           EXIT PROGRAM.
