       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELPER.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-MSG PIC X(13) VALUE 'HELPER-CALLED'.
       PROCEDURE DIVISION.
       HELPER-PARA.
           DISPLAY WS-MSG.
           EXIT PROGRAM.
